test/nginx/ab10.log
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.20.10.20 (be patient)
Completed 200000 requests
Completed 400000 requests
Completed 600000 requests
Completed 800000 requests
Completed 1000000 requests
Completed 1200000 requests
Completed 1400000 requests
Completed 1600000 requests
Completed 1800000 requests
Completed 2000000 requests
Finished 2000000 requests


Server Software:        nginx/1.16.1
Server Hostname:        10.20.10.20
Server Port:            80

Document Path:          /logo.svg
Document Length:        602 bytes

Concurrency Level:      100
Time taken for tests:   110.155 seconds
Complete requests:      2000000
Failed requests:        0
Total transferred:      1498000000 bytes
HTML transferred:       1204000000 bytes
Requests per second:    18156.30 [#/sec] (mean)
Time per request:       5.508 [ms] (mean)
Time per request:       0.055 [ms] (mean, across all concurrent requests)
Transfer rate:          13280.34 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    3   0.4      3       7
Processing:     0    3   0.4      3       7
Waiting:        0    3   0.4      3       7
Total:          3    5   0.8      5       9

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      6
  75%      6
  80%      6
  90%      6
  95%      6
  98%      7
  99%      7
 100%      9 (longest request)