test/nginx/ab10_gzip_dpdk.log
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.20.10.20 (be patient)
Completed 200000 requests
Completed 400000 requests
Completed 600000 requests
Completed 800000 requests
Completed 1000000 requests
Completed 1200000 requests
Completed 1400000 requests
Completed 1600000 requests
Completed 1800000 requests
Completed 2000000 requests
Finished 2000000 requests


Server Software:        nginx/1.16.1
Server Hostname:        10.20.10.20
Server Port:            80

Document Path:          /logo.svg
Document Length:        62 bytes

Concurrency Level:      100
Time taken for tests:   108.404 seconds
Complete requests:      2000000
Failed requests:        0
Total transferred:      416000000 bytes
HTML transferred:       124000000 bytes
Requests per second:    18449.52 [#/sec] (mean)
Time per request:       5.420 [ms] (mean)
Time per request:       0.054 [ms] (mean, across all concurrent requests)
Transfer rate:          3747.56 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   0.4      3       6
Processing:     0    3   0.5      3       7
Waiting:        0    3   0.4      3       6
Total:          2    5   0.9      5      12

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      6
  75%      6
  80%      6
  90%      6
  95%      6
  98%      7
  99%      7
 100%     12 (longest request)